tap "homebrew/bundle"
tap "homebrew/services"
tap "koekeishiya/formulae"
# Vector graphics library with cross-device output support
brew "cairo"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Run arbitrary commands when files change
brew "entr"
# Command-line fuzzy finder written in Go
brew "fzf"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU compiler collection
brew "gcc"
# Disk usage analyzer with console interface written in Go
brew "gdu"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Parser generator for use with Java applications
brew "javacc"
# Lossless LiDAR compression
brew "laszip"
# Simple terminal UI for git commands
brew "lazygit"
# Bare libuv bindings for lua
brew "luv"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@17"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generic machine emulator and virtualizer
brew "qemu"
# Tool for managing OCI containers and pods
brew "podman"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# JVM-based programming language
brew "scala"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Modernized, complete, self-contained TeX/LaTeX engine
brew "tectonic"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Voice and text chat software
cask "discord"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Minimal installer for conda specific to conda-forge
cask "miniforge"
# Store SSH keys in the Secure Enclave
cask "secretive"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "tomoki1207.pdf"
